{"id":3295209,"taskName":"Homework 1","taskDescription":["1. Задано целое число. Определить, какой день недели соответствует заданному числу и вывести в консоль. Если ни одному - вывести соответствующее сообщение.","2. Даны два целых числа, задающие три диапазона чисел. Определить, какому диапазону принадлежит введенное пользователем число.","3. Заданы три числа. Найти среди них минимальное, максимальное и среднее арифметическое и вывести. Без использования дополнительных библиотек, только операторы сравнения и логические.","4. Задано число. Определить, близко ли к нему другое введенное число (в пределах 10%)."],"dateToComplete":1603659600000,"hoursToComplete":2.0,"taskPriority":"HIGH","taskCategory":"NECESSARY"}
{"id":4312190.482422502,"taskName":"Homework 5","taskDescription":[" Изменить поля \"категория\" и \"приоритет\" на перечисляемый тип."," Сделать задачу не abstract. Добавить builder для задачи."," Добавить поле \"id\" и использовать возможность параметризации для этого поля. Должен быть также параметризован конструктор, геттер и сеттер. Создать 2 реализации, параметризованные разными типами (например, String и Integer)"],"dateToComplete":1605474000000,"hoursToComplete":4.5,"taskPriority":"HIGH","taskCategory":"NECESSARY"}
{"id":3946021,"taskName":"Homework 4","taskDescription":["Предметная область: планировщик задач.Требования:","1. Наличие иерархии, отражающей модель \"Задача\" (интерфейс, абстрактный класс, несколько классов-наследников, имеющих разные особенности). Например: одноразовая задача, повторяемая задача.","2. Минимальные характеристики задачи: название, категория, приоритет, дата выполнения (строки).","3. Корректно использовать инкапсуляцию","4. Клиентский код, в котором создаются задачи разных типов."],"dateToComplete":1604610000000,"hoursToComplete":2.0,"taskPriority":"LOW","taskCategory":"DESIRABLE"}
{"id":"665136.2138074602","taskName":"Homework 6","taskDescription":["1. Добавить список задач. Пользовать может добавить задачу в список, просмотреть весь список.","2. Задача должна переопределять методы hashCode и equals, имплементить интерфейс Comparable (переопределить метод compareTo).","3. Пользователь может отсортировать задачи."],"dateToComplete":1605733200000,"hoursToComplete":6.0,"taskPriority":"MIDDLE","taskCategory":"OPTIONAL"}
{"id":8298575,"taskName":"Homework 2","taskDescription":["1*. Вывести пирамиду из цифр. Размер вводится пользователем. Пирамида - фигура такого вида:\n1 1 1 1 1\n1 2 2 2 1\n1 2 3 2 1\n1 2 2 2 1\n1 1 1 1 1","2 (2 балла). Пользователь вводит месяц и день (числа). Вывести, есть ли день в этом месяце.","3 (3 балла). Задать пользователю любой вопрос и дать ограниченное количество попыток для верного ответа. Предусмотреть возможность сдаться.","4 (3 балла). Пользователь вводит число в небольшом диапазоне (от 0 до 100). Программа должна угадать, что это за число и продемонстрировать количество попыток, которое потребовалось для угадывания."],"dateToComplete":1605646800000,"hoursToComplete":2.0,"taskPriority":"LOW","taskCategory":"DESIRABLE"}
{"id":7785788,"taskName":"Homework 3","taskDescription":["1. Сформировать строку, которая содержит 100 случайных значений от 0 до 1000, разделённых пробелами (2 способа - String и StringBuilder).","2. В сформированной в 1-ой задаче строке заменить все двузначные числа на -1. - RegEx - регулярные выражения","3. Пользователь вводит имя и возраст. Вывести сообщение, приветствующее пользователя. - форматирование (String.format) через спецификаторы","4. Разбить строку на отдельные слова и посчитать количество вхождений для каждого слова. - через split - будет считать разделителем пробел"],"dateToComplete":1605560400000,"hoursToComplete":2.0,"taskPriority":"LOW","taskCategory":"DESIRABLE"}
